_Rarzrabotki/Rarus/USO2/Catalogs/уатПрейскурантыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>уатПрейскурантыТС</Name>
			<Comment>Прейскуранты на транспортные услуги (уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/уатТарифыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>уатТарифыТС</Name>
			<Comment>Тарифы на транспортные услуги (уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.уатПрейскурантыТС</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппировкаТарифа1</Name>
					<Comment>Группировка тарифа 1</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппировкиТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаТарифа2</Name>
					<Comment>Группировка тарифа 2</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппировкиТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаТарифа3</Name>
					<Comment>Группировка тарифа 3</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппировкиТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Comment>Параметр выработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяВыработка</Name>
					<Comment>Минимальная выработка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураУслуги</Name>
					<Comment>Номенклатура услуги</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложныйТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Comment>Тариф</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксированныйТариф</Name>
					<Comment>Фиксированный тариф</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Comment>Время начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Comment>Время окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьДействияУдалить</Name>
					<Comment>Удалить в релизе 2.0.3. Значение реквизита из УАТ Стандарт1</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьДействия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тарифы</Name>
					<Comment>Тарифы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗнакГруппировки1</Name>
							<Comment>Знак группировки 1</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.уатЗнакиСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнакГруппировки2</Name>
							<Comment>Знак группировки 2</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.уатЗнакиСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнакГруппировки3</Name>
							<Comment>Знак группировки 3</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.уатЗнакиСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеГруппировки1</Name>
							<Comment>Значение группировки 1</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеГруппировки2</Name>
							<Comment>Значение группировки 2</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеГруппировки3</Name>
							<Comment>Значение группировки 3</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Comment>Тариф</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/уатПрейскурантыТС/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформлениеОбластьДействия();
	
	// УправлениеПредприятием.СлужебныеПодсистемы
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// Конец УправлениеПредприятием.СлужебныеПодсистемы
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменениеТарифаТС" Тогда
		УстановитьУсловноеОформлениеОбластьДействия();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.уатПрейскурантыТС") тогда
		ТекСтрока = Элементы.Список.ТекущиеДанные;
		Если ТекСтрока <> Неопределено И НЕ ТекСтрока.ЭтоГруппа Тогда
			Если ТекСтрока.Ссылка = ВыбранноеЗначение Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите прейскурант-источник, отличный от прейскуранта-приемника.");
				Возврат;
			КонецЕсли;
			
			СкопироватьТарифыИзДругогоПрейскуранта(ТекСтрока.Ссылка, ВыбранноеЗначение);
			Элементы.Тарифы.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.Дерево.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Родитель",,,, Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Родитель", ТекСтрока.Ссылка, 
			ВидСравненияКомпоновкиДанных.ВИерархии);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Тарифы.Отбор, "Владелец", Неопределено);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПериодыДействия.Отбор, "Прейскурант", Неопределено);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Тарифы.Отбор, "Владелец", ТекСтрока.Ссылка);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПериодыДействия.Отбор, "Прейскурант", ТекСтрока.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// УправлениеПредприятием.СлужебныеПодсистемы
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
КонецПроцедуры
// Конец УправлениеПредприятием.СлужебныеПодсистемы

&НаКлиенте
Процедура Калькулятор(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.уатКалькуляторТарифов.Форма", Новый Структура("Прейскурант", ТекСтрока.Ссылка))
КонецПроцедуры

&НаКлиенте
Процедура ОтчетДействующиеПрейскуранты(Команда)
	
	ПрейскурантСсылка = Элементы.Список.ТекущаяСтрока;
	Если ПрейскурантСсылка = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор",                   Новый Структура("Прейскурант", ПрейскурантСсылка));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ОткрытьФорму("Отчет.уатДействующиеПрейскуранты.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьТарифыИз(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран прейскурант-приемник. Для выбора спозиционируйтесь на нужную строку в списке");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.уатПрейскурантыТС.ФормаВыбора",, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеОбластьДействия()
	УслОформление = Тарифы.УсловноеОформление.Элементы;
	
	ВыборкаТарифы = Справочники.уатТарифыТС.Выбрать();
	Пока ВыборкаТарифы.Следующий() Цикл
		Если ВыборкаТарифы.ОбластьДействия = NULL Тогда
			мФильтр = "";
		Иначе
			ТекОбластьДействия = ВыборкаТарифы.ОбластьДействия.Получить();
			Если ТипЗнч(ТекОбластьДействия) <> Тип("НастройкиКомпоновкиДанных")
					ИЛИ ТекОбластьДействия.Отбор.Элементы.Количество() = 0 Тогда
				мФильтр = "";
			Иначе
				мФильтр = уатОбщегоНазначенияТиповые.уатПолучитьПредставлениеОтбора(ТекОбластьДействия.Отбор);
			КонецЕсли;
		КонецЕсли;
		
		НовыйЭлементУслОформления = УслОформление.Добавить();
		офЭл = НовыйЭлементУслОформления.Поля.Элементы.Добавить();
		офЭл.Поле = Новый ПолеКомпоновкиДанных("ОбластьДействияПредставление");
		НовыйЭлементУслОформления.Оформление.УстановитьЗначениеПараметра("Текст", мФильтр);
		НовыйЭлементОтбора = НовыйЭлементУслОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = ВыборкаТарифы.Ссылка;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СкопироватьТарифыИзДругогоПрейскуранта(ПрейскурантПриемник, ПрейскурантИсточник)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатТарифыТС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатТарифыТС КАК уатТарифыТС
	|ГДЕ
	|	уатТарифыТС.Владелец = &Владелец
	|	И НЕ уатТарифыТС.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	уатТарифыТС.ЭтоГруппа,
	|	уатТарифыТС.Ссылка
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Владелец", ПрейскурантИсточник);
	РезЗапроса = Запрос.Выполнить();
	
	СоздатьТарифыПоИерархии(РезЗапроса, ПрейскурантПриемник);
КонецПроцедуры

&НаСервере
Процедура СоздатьТарифыПоИерархии(Выборка, ПрейскурантПриемник, ТекГруппа = Неопределено)
	ТекВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Ссылка"); 
	Пока ТекВыборка.Следующий() Цикл
		//создание тарифа или группы тарифов
		НовТариф = ТекВыборка.Ссылка.Скопировать();
		НовТариф.Владелец = ПрейскурантПриемник;
		Если ЗначениеЗаполнено(ТекГруппа) Тогда
			НовТариф.Родитель = ТекГруппа;
		КонецЕсли;
		
		Попытка 
			НовТариф.Записать();
		Исключение
			ТекстНСТР = НСтр("en='Failed to copy %1 ""%2""';ru='Не удалось скопировать %1 ""%2""'");
			ТекстНСТР = СтрШаблон(ТекстНСТР,
				?(ТекВыборка.Ссылка.ЭтоГруппа, НСтр("en='tariffs group';ru='группу тарифов'"), НСтр("en='tariff';ru='тариф'")),
				НовТариф.Наименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		КонецПопытки;
		
		Если ТекВыборка.Ссылка.ЭтоГруппа Тогда
			СоздатьТарифыПоИерархии(ТекВыборка, ПрейскурантПриемник, НовТариф.Ссылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
